{
  "meta": {
    "defaultLang": "pt",
    "updatedAt": "2026-01-31"
  },
  "assets": {
    "avatar": "avatar.png",
    "bgDoodles": "Doodles.png",
    "bgLeft": "DoodleLeft.png",
    "bgRight": "Doodles.png"
  },
  "theme": {
    "accent": "#4E86A8",
    "bg": "#151A20",
    "panel": "#1C222A",
    "text": "#E9EEF3",
    "muted": "#AAB7C4",
    "line": "rgba(255,255,255,0.22)"
  },
  "languages": {
    "pt": {
      "labels": {
        "experience": "EXPERIÊNCIA",
        "contact": "CONTATO",
        "education": "FORMAÇÃO",
        "tools": "FERRAMENTAS",
        "skills": "HABILIDADES",
        "printPdf": "Imprimir / PDF",
        "coverLetter": "Carta"
      },
      "coverLetter": {
        "greeting": "Querido Leitor,",
        "paragraphs": [
          "Ao longo da minha trajetória profissional, atuei no desenvolvimento de soluções digitais orientadas a impacto mensurável, combinando engenharia de software, ciência de dados, automação e liderança técnica para resolver problemas complexos de negócio.",
          "Tenho experiência sólida na entrega de sistemas baseados em Machine Learning, RPA e analytics, aplicados a ambientes de alta complexidade operacional. Esses projetos resultaram na automação de mais de 85% de processos antes manuais, construção de dezenas de dashboards executivos e implementação de pipelines de dados escaláveis, suportando decisões críticas em tempo quase real.",
          "Os resultados obtidos incluem reduções recorrentes de custos na ordem de milhões de reais por ano, como economias superiores a R$ 850 mil/ano em insumos, R$ 1,2 milhão/ano em custos de mão de obra, R$ 800 mil/ano via renegociação de contratos e reduções expressivas em estoques, chegando a R$ 1,8 milhão/mês em itens de alto giro e R$ 150 mil/mês em materiais obsoletos. Adicionalmente, sistemas de auditoria automatizada reduziram em até 90% erros operacionais relacionados a uso de produtos, orçamento e rastreabilidade.",
          "Atuei diretamente na concepção e implementação de soluções analíticas e de IA utilizando BigQuery, Azure, Power Platform, Python, SQL e BI, integrando dados corporativos, automações inteligentes e ferramentas de apoio à decisão com foco em produtividade, eficiência científica e governança.",
          "Além da entrega técnica, exerci papel ativo na liderança de squads multidisciplinares, mentoria de desenvolvedores e definição de padrões arquiteturais, bem como na atuação em segurança da informação, assumindo responsabilidades como Information Security Manager (ISM) em contextos corporativos críticos. Esse conjunto de iniciativas foi reconhecido com 8 prêmios QMS LATAM e 2 prêmios ICS Global.",
          "Minha formação em Engenharia e Doutorado em Engenharia de Software, aliada à vivência prática em transformação digital e inovação, sustenta uma atuação orientada a resultados, onde dados são convertidos em valor financeiro, eficiência operacional e vantagem competitiva sustentável."
        ],
        "closing": "Atenciosamente,",
        "signature": "Danillo Xavier"
      },
      "profile": {
        "name": "DANILLO XAVIER",
        "headline": "Engenheiro de Software &\nPhD em Machine Learning",
        "summary": [
          "Casado, pai de uma linda menina, natural de Serra Talhada - PE, criado em Distrito de Pilar-BA.",
          "Formado em Engenharia de Produção e PhD em Machine Learning. Possuo sólidos conhecimentos em Ciência de Dados, Desenvolvimento de Sistemas e aplicativos, Deep Learning, Big Data e Business Intelligence.",
          "Curiosidades: Faixa Preta de Karatê Shotokan (assim como minha esposa). Apaixonado por cinema, jogos e pelo universo artístico 3D. Pratico o esporte de corrida de rua (15km). Estudo a criação de curtas-metragens com foco na Caatinga e no povo nordestino."
        ]
      },
      "contact": {
        "items": [
          {
            "label": "Nascimento",
            "value": "05/07/1990"
          },
          {
            "label": "Endereço",
            "value": "Rua da Codorna n° 41,\nColinas do rio, Petrolina-PE"
          },
          {
            "label": "Telefones",
            "value": "(87) 9 8133-6310\n(74) 9 9968-7011"
          },
          {
            "label": "Email",
            "value": "danillox5@hotmail.com"
          },
          {
            "label": "CREA-PE",
            "value": "181609909-0"
          }
        ],
        "social": [
          {
            "label": "/cientista-de-dados",
            "icon": "in"
          }
        ]
      },
      "experience": [
        {
          "from": "MAIO 2024",
          "to": "ATUAL",
          "company": "BAYER CROP\nSCIENCE",
          "role": "TECHNOLOGY ENABLEMENT LEAD",
          "paragraphs": [
            "Sou responsável pelo desenvolvimento de ferramentas de auxílio aos pesquisadores dos pipelines de melhoramento genético de Milho e Soja.",
            "Dentre as principais contribuições estão ferramentas de tomada de decisão automatizada com RPA, Machine Learning e Ciência de Dados."
          ]
        },
        {
          "from": "JANEIRO 2019",
          "to": "ABRIL 2024",
          "company": "AGRODAN",
          "role": "HEAD CORPORATIVO DE TECNOLOGIA E INOVAÇÃO /\nGERENTE ADMINISTRATIVO",
          "paragraphs": [
            "Desenvolvi um sistema de informação integrado para geração de relatórios e coleta de dados offline. Ao longo de 5 anos foram mais de 30 módulos e 150 relatórios que vão do Campo ao setor de Embalagem.",
            "Realizei um processo de inovação Aberta, Agrodan Tech, que trouxe tecnologias inovadoras ao processo. No total, 7 startups foram selecionadas. O saving de negociação chegou a R$ 800.000,00 anuais via ajuste de contrato."
          ]
        }
      ],
      "education": [
        {
          "from": "2020",
          "to": "2025",
          "school": "CÉSAR SCHOOL",
          "degree": "DOUTORADO PROFISSIONAL\nEM ENGENHARIA DE SOFTWARE",
          "details": [
            "Tese: Algoritmos Evolutivos na problemática do Feature Selection em algoritmos de regressão.",
            "BDs: Irrigação (Kc), Calibres da Manga, Produtividade"
          ]
        },
        {
          "from": "JULHO 2022",
          "to": "JULHO 2023",
          "school": "UNIMAIS",
          "degree": "ESPECIALIZAÇÃO EM\nENGENHARIA DE SEGURANÇA DO\nTRABALHO",
          "details": [
            "TCC: AgriGuard — Software georreferenciado para monitoramento de riscos em ambiente agrícola"
          ]
        },
        {
          "from": "JANEIRO 2017",
          "to": "MARÇO 2018",
          "school": "UNINASSAU",
          "degree": "ESPECIALIZAÇÃO EM\nENGENHARIA DE SOFTWARE E\nGERENCIAMENTO DE PROJETOS",
          "details": [
            "TCC: Implementação da metodologia SCRUM em uma Plataforma Web"
          ]
        },
        {
          "from": "2013",
          "to": "2016",
          "school": "UNIVASF",
          "degree": "ENGENHARIA DE PRODUÇÃO",
          "details": [
            "TCC: F-AHP: Software Java para a aplicação do Método de Decisão Multicritério AHP"
          ]
        }
      ],
      "tools": [
        {
          "name": "GCP | Azure | AWS",
          "level": 4
        },
        {
          "name": "Oracle SQL | SQL SERVER, BigQuery",
          "level": 5
        },
        {
          "name": "Power BI | Power Platform",
          "level": 3
        },
        {
          "name": "DBT | AirFlow | PySpark",
          "level": 2
        },
        {
          "name": "scikit-learn | MLflow | XGBoost",
          "level": 5
        },
        {
          "name": "Docker | Kubernetes | Terraform",
          "level": 2
        }
      ],
      "skills": [
        {
          "name": "PMBOK | SCRUM | Kanban",
          "level": 4
        },
        {
          "name": "AI | ML | DevOps | MLOps",
          "level": 4
        },
        {
          "name": "Web/Mobile",
          "level": 5
        },
        {
          "name": "BPMN 2.0 / RPA",
          "level": 5
        },
        {
          "name": "ETL",
          "level": 5
        },
        {
          "name": "Comunicação | Liderança",
          "level": 5
        }
      ]
    },
    "en": {
      "labels": {
        "experience": "EXPERIENCE",
        "contact": "CONTACT",
        "education": "EDUCATION",
        "tools": "TOOLS",
        "skills": "SKILLS",
        "printPdf": "Print / PDF",
        "coverLetter": "Cover Letter"
      },
      "coverLetter": {
        "greeting": "Dear Reader,",
        "paragraphs": [
        "Throughout my professional journey, I have focused on delivering digital solutions with measurable business impact, combining software engineering, data science, automation and technical leadership to solve complex, real-world problems.",
"I have extensive experience delivering Machine Learning, RPA and analytics-driven systems in highly complex operational environments. These initiatives enabled the automation of over 85% of previously manual processes, the creation of dozens of executive dashboards, and the deployment of scalable data pipelines supporting near real-time decision-making.",

"Key outcomes include recurring multi-million BRL annual cost reductions, such as BRL 850K/year in input savings, BRL 1.2M/year in labor cost optimization, BRL 800K/year through contract renegotiation, and significant inventory reductions reaching BRL 1.8M/month for fast-moving items and BRL 150K/month for obsolete stock. Automated auditing systems also reduced operational errors by up to 90%, improving traceability, compliance and process reliability.",

"My work involved the design and implementation of AI-driven decision support tools, analytics platforms and automation frameworks using BigQuery, Azure, Power Platform, Python, SQL and BI technologies, with a strong focus on productivity, research efficiency and data governance.",

"Beyond technical delivery, I have led cross-functional teams, mentored developers, defined architectural standards and contributed to information security governance, serving as an Information Security Manager (ISM) in critical delivery contexts. These contributions were recognized with 8 QMS LATAM awards and 2 ICS Global awards.",

"Supported by an academic background in Engineering and a PhD in Software Engineering, combined with hands-on experience in digital transformation and innovation, I consistently translate data into financial results, operational efficiency and sustainable competitive advantage."],
        "closing": "Sincerely,",
        "signature": "Danillo Xavier"
      },
      "profile": {
        "name": "DANILLO XAVIER",
        "headline": "Software Engineer &\nPhD in Machine Learning",
        "summary": [
          "Married, father of a wonderful daughter, born in Serra Talhada - PE, raised in Distrito de Pilar-BA.",
          "Graduated in Production Engineering and PhD in Machine Learning. Solid knowledge in Data Science, Systems and App Development, Deep Learning, Big Data, and Business Intelligence.",
          "About me: Black belt in Shotokan Karate (same as my wife). Passionate about movies, games and the 3D art universe. I practice road running (15km). I study short-film creation focused on the Caatinga and the people of Northeast Brazil."
        ]
      },
      "contact": {
        "items": [
          {
            "label": "Birth",
            "value": "07/05/1990"
          },
          {
            "label": "Address",
            "value": "Rua da Codorna n° 41,\nColinas do rio, Petrolina-PE"
          },
          {
            "label": "Phones",
            "value": "+55 (87) 9 8133-6310\n+55 (74) 9 9968-7011"
          },
          {
            "label": "Email",
            "value": "danillox5@hotmail.com"
          },
          {
            "label": "CREA-PE",
            "value": "181609909-0"
          }
        ],
        "social": [
          {
            "label": "/scientist-data",
            "icon": "in"
          }
        ]
      },
      "experience": [
        {
          "from": "MAY 2024",
          "to": "PRESENT",
          "company": "BAYER CROP\nSCIENCE",
          "role": "TECHNOLOGY ENABLEMENT LEAD",
          "paragraphs": [
            "Responsible for developing tools that support researchers in corn and soybean breeding pipelines.",
            "Key contributions include automated decision-support tools using RPA, Machine Learning and Data Science."
          ]
        },
        {
          "from": "JAN 2019",
          "to": "APR 2024",
          "company": "AGRODAN",
          "role": "CORPORATE HEAD OF TECHNOLOGY & INNOVATION /\nADMINISTRATIVE MANAGER",
          "paragraphs": [
            "Built an integrated information system for reporting and offline data collection. Over 5 years, delivered 30+ modules and 150 reports spanning field operations to the packaging sector.",
            "Led an Open Innovation program (Agrodan Tech) bringing innovative technologies to the process. 7 startups were selected; negotiation savings reached ~R$ 800,000/year via contract adjustments."
          ]
        }
      ],
      "education": [
        {
          "from": "2020",
          "to": "2025",
          "school": "CÉSAR SCHOOL",
          "degree": "PROFESSIONAL DOCTORATE\nIN SOFTWARE ENGINEERING",
          "details": [
            "Thesis: Evolutionary Algorithms for Feature Selection in regression algorithms.",
            "Datasets: Irrigation (Kc), Mango sizes, Productivity"
          ]
        },
        {
          "from": "JUL 2022",
          "to": "JUL 2023",
          "school": "UNIMAIS",
          "degree": "POSTGRADUATE IN\nOCCUPATIONAL SAFETY\nENGINEERING",
          "details": [
            "Capstone: AgriGuard — Georeferenced software for risk monitoring in agricultural environments"
          ]
        },
        {
          "from": "JAN 2017",
          "to": "MAR 2018",
          "school": "UNINASSAU",
          "degree": "POSTGRADUATE IN\nSOFTWARE ENGINEERING &\nPROJECT MANAGEMENT",
          "details": [
            "Capstone: Implementing SCRUM in a free web platform"
          ]
        },
        {
          "from": "2013",
          "to": "2016",
          "school": "UNIVASF",
          "degree": "PRODUCTION ENGINEERING",
          "details": [
            "Capstone: F-AHP: Java software to apply the AHP multi-criteria decision method"
          ]
        }
      ],
      "tools": [
        {
          "name": "GCP | Azure | AWS",
          "level": 4
        },
        {
          "name": "Oracle SQL | SQL SERVER | POSTGRESQL",
          "level": 5
        },
        {
          "name": "Power BI",
          "level": 3
        },
        {
          "name": "DBT | AirFlow | PySpark",
          "level": 2
        },
        {
          "name": "scikit-learn | MLflow | XGBoost | LightGBM",
          "level": 5
        },
        {
          "name": "Docker | Kubernetes | Terraform",
          "level": 2
        }
      ],
      "skills": [
        {
          "name": "PMBOK | SCRUM | Kanban",
          "level": 4
        },
        {
          "name": "AI | ML | DevOps | MLOps",
          "level": 4
        },
        {
          "name": "Web/Mobile",
          "level": 5
        },
        {
          "name": "BPMN 2.0 / RPA",
          "level": 5
        },
        {
          "name": "ETL",
          "level": 5
        },
        {
          "name": "Comunication | Leadership",
          "level": 5
        }
      ]
    }
  }
}